#-*-coding:utf-8-*-

#1．相对路径是相对于什么？
# 是相对于当前的工作目录

#2．绝对路径从什么开始？
# 绝对路径是从根目录开始

#3． os.getcwd()和 os.chdir()函数做什么事？
# os.getcwd() 取得当前工作路径的字符串
# os.chdir() 改变当前的工作路径

#4． .和..文件夹是什么？
# '.'是当前目录的缩写
# '..'是父目录的缩写

#5． 在 C:\bacon\eggs\spam.txt 中， 哪一部分是目录名称， 哪一部分是基本名称？
# 目录名称：C:\bacon\eggs\
# 基本名称：spam.txt

#6．可以传递给 open()函数的 3 种“模式”参数是什么？
# r读模式；w写模式，用一个新值复写原来的值；
# a添加模式，在已有文件末尾添加文件


#7．如果已有的文件以写模式打开，会发生什么？
# 写模式会将新输入的值覆盖原有的值

#8． read()和 readlines()方法之间的区别是什么？
# read()方法返回保存在文件中的字符串
# readlines() 返回一个字符串的列表，其中每个字符串式文件内容中的一行

#9． shelf 值与什么数据结构相似？
# 字典结构